Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 8)         224
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 8)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0
_________________________________________________________________
dense_1 (Dense)              (None, 64)                524352
=================================================================
Total params: 524,576
Trainable params: 524,576
Non-trainable params: 0
_________________________________________________________________